* Publish
#+begin_src ipython :session apue :results output
import glob
import os
import re
import subprocess

htmls = glob.glob("*.xhtml")
# print(htmls)
htmls.sort(key=lambda x: int(x[0:2]))

# print(htmls)
# for i, e in enumerate(htmls, start=1):
#     os.rename(e, f"{i:02}.xhtml")

for html in htmls:
    cmd = f"pandoc --wrap=none {html} -o {re.sub(r'xhtml$', 'org', html)}"
    assert cmd.endswith("org"), "not ends with org"
    subprocess.run(cmd, shell=True)

print(os.listdir())

#+end_src

#+RESULTS:
: ['13.org', '17.org', '24.org', '07.org', 'readme.org', '12.org', '15.Interprocess Communication.org', '24.xhtml', '01.org', '14.xhtml', '05.xhtml', '18.xhtml', '02.xhtml', '22.org', '15.xhtml', '14.org', '20.xhtml', '16.xhtml', '02.org', '19.org', '12.xhtml', '11.xhtml', '10.org', '17.xhtml', '08.org', '13.xhtml', '07.xhtml', '10.xhtml', '04.org', '11.org', '21.org', '21.xhtml', '25.org', '15.org', '01.xhtml', '04.xhtml', '03.org', '16.org', '08.xhtml', '22.xhtml', '20.org', '06.xhtml', '06.org', '23.org', '25.xhtml', '09.xhtml', '18.org', '00.Preface.org', '03.xhtml', '09.org', '19.xhtml', '23.xhtml', '05.org']

#+begin_src ipython :session apue :results value
!ls 
#+end_src

#+RESULTS:
: # Out[68]:

#+begin_src ipython :session apue :results output
!pandoc --wrap=none 00.Preface.org -o ~/Public/nikola_post/posts/读书评注:APUE.rst

#+end_src

#+RESULTS:
: pandoc: /home/gaowei/Public/nikola_post/posts/读书评注:APUE.rst: openFile: does not exist (No such file or directory)

* Add chapter names

#+begin_src ipython :session apue :results output
print(cs)
import glob
import os

orgs = glob.glob("*.org")
orgs.sort(key=lambda x: x[:2])
orgs = orgs[1:23]


for old, new in td:
    os.rename(old, new)

print(orgs)
#+end_src

#+RESULTS:
: ['01.UNIX-System-Overview', '02.UNIX-Standardization-and-Implementations', '03.File-IO', '04.Files-and-Directories', '05.Standard-IO-Library', '06.System-Data-Files-and-Information', '07.Process-Environment', '08.Process-Control', '09.Process-Relationships', '10.Signals', '11.Threads', '12.Thread-Control', '13.Daemon-Processes', '14.Advanced-IO', '15.Interprocess-Communication', '16.Network-IPC:-Sockets', '17.Advanced-IPC', '18.Terminal-IO', '19.Pseudo-Terminals', '20.A-Database-Library', '21.Communicating-with-a-Network-Printer']
: ['21.org', '22.org', '23.org', '24.org', '25.org', 'readme.org', 'test.org']


#+begin_src ipython :session apue :results output
# 忘记加后缀名
# ! rm *.xhtml
fs = os.listdir()
fs = filter(lambda x: not x.endswith("org"), fs)
print(list(fs))
# map(lambda x: os.rename(x, f"{x}.org"), fs)
! ls
# print(fs)
#+end_src

#+RESULTS:
#+begin_example
['19.Pseudo-Terminals', '12.Thread-Control', '05.Standard-IO-Library', '07.Process-Environment', '03.File-IO', '04.Files-and-Directories', '09.Process-Relationships', '11.Threads', '18.Terminal-IO', '10.Signals', '16.Network-IPC:-Sockets', '13.Daemon-Processes', '17.Advanced-IPC', '20.A-Database-Library', '15.Interprocess-Communication', '08.Process-Control', '06.System-Data-Files-and-Information', '21.Communicating-with-a-Network-Printer', '14.Advanced-IO', '01.UNIX-System-Overview', '02.UNIX-Standardization-and-Implementations']
00.Preface.org
01.UNIX-System-Overview
02.UNIX-Standardization-and-Implementations
03.File-IO
04.Files-and-Directories
05.Standard-IO-Library
06.System-Data-Files-and-Information
07.Process-Environment
08.Process-Control
09.Process-Relationships
10.Signals
11.Threads
12.Thread-Control
13.Daemon-Processes
14.Advanced-IO
15.Interprocess-Communication
16.Network-IPC:-Sockets
17.Advanced-IPC
18.Terminal-IO
19.Pseudo-Terminals
20.A-Database-Library
21.Communicating-with-a-Network-Printer
21.org
22.org
23.org
24.org
25.org
readme.org
test.org
#+end_example

#+begin_src ipython :session alinbx :results output
import os
import glob
import copy

fs = os.listdir()
fs = filter(lambda x: not x.endswith("org"), fs)
fsc = copy.deepcopy(fs)
print(list(fsc)[:5])
#
#+end_src

#+RESULTS:
: ['19.Pseudo-Terminals', '12.Thread-Control', '05.Standard-IO-Library', '07.Process-Environment', '03.File-IO']


#+begin_src ipython :session alinbx :results output
map(lambda x: os.rename(x, x+'.org'), fs)
! ls | head -n 5
#+end_src

#+RESULTS:
: 00.Preface.org
: 01.UNIX-System-Overvie
: 01.xhtml
: 02.UNIX-Standardization-and-Implementations
: 03.File-IO


#+begin_src ipython :session alinbx :results output
for f in fs:
    os.rename(f, f"{f}.org")
! ls | head -n 5
#+end_src

#+RESULTS:
: 00.Preface.org
: 01.UNIX-System-Overview.org
: 01.xhtml.org
: 02.UNIX-Standardization-and-Implementations.org
: 03.File-IO.org
